PH/batch/OfflineWTB/ntlHelperBinding.WithdrawInit.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns1="https://www.twv.com.tw/gps.new/sys/server_HK101001.php?wsdl"
 xmlns:ns2="https://www.twv.com.tw/gps.new/sys/server">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns2:WithdrawInit>
   <access_key></access_key>
   <withdraw_list SOAP-ENC:arrayType="ns1:WithdrawInitInfo[1]">
    <item>
     <order_num></order_num>
     <bank_code></bank_code>
     <bank_branch></bank_branch>
     <account_id></account_id>
     <account_name></account_name>
     <account_no></account_no>
     <amount>0</amount>
    </item>
   
    <item>
     <order_num></order_num>
     <bank_code></bank_code>
     <bank_branch></bank_branch>
     <account_id></account_id>
     <account_name></account_name>
     <account_no></account_no>
     <amount>0</amount>
    </item>
   </withdraw_list>
  </ns2:WithdrawInit>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
