PH/batch/OnlinePayout/ntlHelperBinding.DepositOnlineInit.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns1="https://www.twv.com.tw/gps.new/sys/server_HK130501.php?wsdl"
 xmlns:ns2="https://www.twv.com.tw/gps.new/sys/server">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns2:DepositOnlineInit>
   <access_key></access_key>
   <order_num></order_num>
   <amount>0</amount>
   <description></description>
   <return_url></return_url>
  </ns2:DepositOnlineInit>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
